In [1]:
#Setting up environment
import pandas as pd
import psycopg2
from IPython.display import display
from sqlalchemy import create_engine

In [4]:
#Importing DATASET and show your first lines
df = pd.read_csv('Chocolate Sales.csv', sep=',')
display(df.head())

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [5]:
#LAST LINES OF DATAFRAME
df.tail(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [15]:
display(df.shape)
display(df.isnull().sum())
if df.isnull().sum().sum() == 0:
    print('Nenhum valor nulo nas colunas')

(1094, 6)

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

Nenhum valor nulo nas colunas

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   datetime64[ns]
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 51.4+ KB

In [33]:
#Transform ''date'' to datetime
df['Date'] = pd.to_datetime(df['Date'],  format='%Y-%m-%d')
#FORMATING 'AMOUNT' to INT:
df['Amount'] = df['Amount'].replace({'$':'', ',' : ''}, regex=True).astype(int)

In [34]:
display(df.head())

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,5320,180
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,7896,94
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,4501,91
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,12726,342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,2022-02-24,13685,184

In [41]:
#creating metrics

#PRODUCT WITH THE MOST REVENUE:
product_most_sales = df.groupby('Product')['Amount'].sum().reset_index(name='Total_Sales').sort_values(by='Total_Sales', ascending=False)
display(product_most_sales)

                 Product  Total_Sales
19    Smooth Sliky Salty       349692
0         50% Dark Bites       341712
21            White Choc       329147
17   Peanut Butter Cubes       324842
10               Eclairs       312445
3        99% Dark & Pure       299796
2          85% Dark Bars       299229
16   Organic Choco Syrup       294700
20   Spicy Special Slims       293454
14       Mint Chip Choco       283969
5           Almond Choco       277536
12    Manuka Honey Choco       275541
13             Milk Bars       269248
18       Raspberry Choco       264740
4            After Nines       261331
11      Fruit & Nut Bars       259147
9          Drinking Coco       256655
15          Orange Choco       256144
6    Baker's Choco Chips       249613
8   Choco Coated Almonds       241486
7   Caramel Stuffed Bars       231588
1         70% Dark Bites       211610

In [46]:
#THE MOST Boxes Shipped:>
most_shipped = df.groupby('Product')['Boxes Shipped'].max().reset_index(name='Boxes Shipped').sort_values(by='Boxes Shipped', ascending=False)
display(most_shipped)

                 Product  Boxes Shipped
9          Drinking Coco            709
0         50% Dark Bites            708
7   Caramel Stuffed Bars            614
1         70% Dark Bites            597
10               Eclairs            591
12    Manuka Honey Choco            581
19    Smooth Sliky Salty            554
6    Baker's Choco Chips            524
20   Spicy Special Slims            520
4            After Nines            520
15          Orange Choco            512
2          85% Dark Bars            508
11      Fruit & Nut Bars            482
14       Mint Chip Choco            465
17   Peanut Butter Cubes            446
13             Milk Bars            430
5           Almond Choco            424
3        99% Dark & Pure            416
18       Raspberry Choco            415
8   Choco Coated Almonds            408
21            White Choc            370
16   Organic Choco Syrup            356

In [49]:
#REGION WITH THE MOST ORDERS
best_region = df.groupby('Country')['Country'].count().reset_index(name='Quantity Orders')
display(best_region)

       Country  Quantity Orders
0    Australia              205
1       Canada              175
2        India              184
3  New Zealand              173
4           UK              178
5          USA              179

In [52]:
#REGIONS WITH MORE REVENUES:
revenues_country = df.groupby('Country')['Amount'].sum().reset_index(name='Revenue').sort_values(by='Revenue',ascending=False)
display(revenues_country)

       Country  Revenue
0    Australia  1137367
4           UK  1051792
2        India  1045800
5          USA  1035349
1       Canada   962899
3  New Zealand   950418

In [1]:
average_revenue_country = df.groupby('Country')['Amount'].mean().reset_index(name='Average_Revenue').sort_values(by='Average_Revenue', ascending=False)
display(average_revenue_country)

NameError: name 'df' is not defined